/*
С. Галеони, сіклі і кнати
Виявляється, маги також користуються грошима! У них в ходу золоті, срібні і
бронзові монети, які називаються відповідно галеонами, сіклями і кнатами. Один
галеон містить сімнадцять сіклів, а один сікль – двадцять дев’ять кнатів. Усі грошові
дані (ціни, налічні гроші) формуються у галеонах, сіклях і кнатах, до того ж
кількість сіклів не перевищує 16, а кількість кнатів – 28.
Гарі Потер перед вступом до Хогвардсу отримав у банку «Грінгготс» на певну
суму. Але вступникам необхідно купити абсолютно необхідні для навчання речі:
чарівну паличку, сову, мантії, олов’яний котел, мідні терези …
Скільки грошей виявиться у Гарі Потера після усіх покупок?
*/


#include <iostream>
using namespace std;

int main() {
    long long g, s, k;
    cin >> g >> s >> k;
    long long total = g * 17 * 29 + s * 29 + k;

    int N;
    cin >> N;
    for (int i = 0; i < N; ++i) {
        cin >> g >> s >> k;
        long long cost = g * 17 * 29 + s * 29 + k;
        total = total - cost;
    }
    if (total < 0) {
        cout << -1;
        return 0;
    }
    long long knuts_per_galleon = 17 * 29;
    long long g2 = total / knuts_per_galleon;
    long long rem = total % knuts_per_galleon;
    long long s2 = rem / 29;
    long long k2 = rem % 29;

    cout << g2 << " " << s2 << " " << k2;
    return 0;
}
